# Creating DataFrames
Let’s look at different ways to create a Pandas DataFrame — the core data structure you’ll be using 90% of the time in data science.

# From Python Lists

In [3]:
import pandas as pd 
data = [
    ["harry",34],["jack",67],["tak",27],["mank",64],["perk",87]
]

In [4]:
data

[['harry', 34], ['jack', 67], ['tak', 27], ['mank', 64], ['perk', 87]]

In [5]:
pd.DataFrame(data,columns=["Name","Marks"])

    Name  Marks
0  harry     34
1   jack     67
2    tak     27
3   mank     64
4   perk     87

In [6]:
data = {"a":[1,2,3],"b":[4,5,6]}
data

{'a': [1, 2, 3], 'b': [4, 5, 6]}

In [7]:
df=pd.DataFrame(data)
df

   a  b
0  1  4
1  2  5
2  3  6

In [8]:
import numpy as np
arr = np.array([[1,2,3],[4,5,6]])
df = pd.DataFrame(arr,columns=["A","B","C"])

In [9]:
df

   A  B  C
0  1  2  3
1  4  5  6

In [17]:
df = pd.read_excel(r"C:\Users\Anshika\OneDrive\Desktop\Data-Science-Journey-2026\data.xlsx.xlsx")
df

      NAME SCHOOL  MARKS
0    anshi    DPS     56
1  anshika    DPS     78
2    avani    LLS     89
3    priya    LLS     89
4    aliza    RDS     45
5    sanya    RDS     56

In [23]:
df = pd.read_csv(r"C:\Users\Anshika\OneDrive\Desktop\Data-Science-Journey-2026\data.csv")
df

      NAME SCHOOL  MARKS
0    anshi    DPS     56
1  anshika    DPS     78
2    avani    LLS     89
3    priya    LLS     89
4    aliza    RDS     45
5    sanya    RDS     56